{"_type": "vaultReview", "_id": "vault-steel-magnolias", "slug": {"_type": "slug", "current": "steel-magnolias"}, "title": "Steel Magnolias", "director": "Herbert Ross", "year": "1989", "publishedDate": "2025-11-01", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/m8yXQYp7mKkF1iVwL8H4f9r6Z0z.jpg", "verdict": "The saccharine nature of this stagelike production is exhausting.", "paragraphs": ["The saccharine nature of Steel Magnolias is exhausting. Regal’s Novs series (an increasingly lazy title for their monthly series of re-releases) brought this back to the big screen, and I can see the appeal of it as comfort food cinema. It has a cozy Southern charm and an ensemble cast of legends, so watching them bounce off each other is fun in a stagelike way.", "But it’s obviously a stage play, and not in a good way. It feels visually flat. The action is confined to a few rooms, and the direction does nothing to open it up. The time jumps are confusing, making the narrative feel disjointed. It feels like a series of scenes designed solely to manipulate your emotions.", "The funeral scene is the peak of this manipulation because it doesn't feel earned. It feels like the movie is grabbing you by the shoulders and screaming, Cry now! It feels cheeky, like the director knew he had Sally Field and just told her to go nuts. I got a little emotional by the end, sure, but I felt resentful about it. You have to buy into the bullshit to fully get this movie, and I just wasn't buying the emotionality of it all."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/steel-magnolias/umc.cmc.3yv30y7rlyv4u06p99990888"}
{"_type": "vaultReview", "_id": "vault-good-will-hunting", "slug": {"_type": "slug", "current": "good-will-hunting"}, "title": "Good Will Hunting", "director": "Gus Van Sant", "year": "1997", "publishedDate": "2025-11-02", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/87YFAtU839CqMv9mE18680E53z0.jpg", "verdict": "A beloved fall classic that remains slightly elusive in its perfection.", "paragraphs": ["Back in September, Regal launched a Month of Masterpieces, featuring 30 films that many would consider masterpieces. It was an incredible month of being able to see some of the greatest movies ever made in a theater for the first time. October naturally followed up with a series of horror films, and come November, it seemed the easiest thing would be to make a series of... well, I'm not quite sure. It became a very bizarre week of November-themed films. Our first week began with fall, and so naturally Good Will Hunting plays because it's a fall-type movie.", "I'm going to keep my thoughts, actually, rather brief on this. I love this movie, but there's something missing. I was talking to Sammy about this when I saw the movie was playing, and he expressed this idea to me. I think it's the best way of putting the film, because it has so much going for it, and yet it does feel like there is something missing. I'm a film critic, so I should be able to point out what those things are, but I simply can't, so I'm going to leave it there. I like the movie. There's something I can't quite put my finger on that is holding me back from loving it even more, but who am I to complain?"], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/good-will-hunting/umc.cmc.2it70p9v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-fallen-angels", "slug": {"_type": "slug", "current": "fallen-angels"}, "title": "Fallen Angels", "director": "Wong Kar-wai", "year": "1995", "publishedDate": "2025-11-03", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/s7O3SExW5mXhX5rO0D6h8u7vS6o.jpg", "verdict": "A neon-soaked visual experiment that prioritizes atmosphere over narrative weight.", "paragraphs": ["Fallen Angels is an interesting film because it feels like a moody remix of Chungking Express. It’s beautifully shot, prioritizing atmosphere over narrative coherence. Director Wong Kar-wai treats the film as a visual poem, and cinematographer Christopher Doyle uses extreme wide-angle lenses to distort the close-ups, making the characters feel isolated and alien even when they’re in crowded rooms.", "The visual language is striking. The world is neon-soaked, gorgeous, and lonely. However, the film suffers from thin characterization. The vignettes, told through a fragmented structure, aren't interesting enough to sustain the runtime. It lacks the cohesive emotional arc of Wong's best work. It feels disjointed.", "It works better as something you look at rather than something you experience. It doesn't feel particularly profound. It’s an entertaining visual experiment, but it feels like a collection of B-sides from a better album. It’s a worthy watch for the cinematography alone, but it doesn't remain in your heart the way Chungking Express did."], "footerText": "Rent or buy on Amazon", "footerLink": "https://www.amazon.com/Fallen-Angels-Leon-Lai/dp/B08XN6G5X6"}
{"_type": "vaultReview", "_id": "vault-tampopo", "slug": {"_type": "slug", "current": "tampopo"}, "title": "Tampopo", "director": "Juzo Itami", "year": "1985", "publishedDate": "2025-11-04", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/x2mN6P5mYp6X8D6f0E4g7u7vS6o.jpg", "verdict": "A sensory celebration of food that balances absurdity with genuine craft.", "paragraphs": ["It's usually a gamble when a movie relies on a series of vignettes because it's so easy to get lost in the shuffle. You often end up feeling like the side stories don't matter or that they're just killing time until we get back to the main plot, but Tampopo manages to avoid that trap entirely. As someone who loves cooking, I found the whole thing so interesting because it prioritizes the sensory experience of food above everything else. It’s a visually rich and staggering film where you can practically taste the broth through the screen, and the sound design, especially all that terrific slurping, makes the act of eating feel like the most important thing in the world.", "The film is often called a Ramen Western, and it’s funny how well that works. It’s a really hard line to balance because parodies usually make the stakes feel less useful or meaningful, but here the cowboy hats and the quest for the perfect noodle actually make the story feel epic while staying hilarious. I loved the frame story about Tampopo’s training because there’s such a genuine sense of care behind it. It’s especially cool to see her level of intrigue when she’s spying on other shops to figure out the secrets of their soup. Watching her dedication to the craft makes the whole journey feel endearing and engaging.", "The way it handles its absurdity is a nice distraction rather than an irritation. Each of the vignettes is totally different from the next, yet they all build into a similar theme about the different ways people find passion and joy in food. Whether it's the man in the white suit or a group of salarymen, it all feels like a celebration of creativity. It’s inspiring to see how much thought went into every little moment, and it all culminates in an ending that’s satisfying and fun. It’s just a unique, well-done movie that makes you want to go out and find a perfect bowl of ramen the second the credits roll."], "footerText": "Rent or buy on Amazon", "footerLink": "https://www.amazon.com/Tampopo-English-Subtitled-Ken-Watanabe/dp/B01MTBN9U6"}
{"_type": "vaultReview", "_id": "vault-legends-of-the-fall", "slug": {"_type": "slug", "current": "legends-of-the-fall"}, "title": "Legends of the Fall", "director": "Edward Zwick", "year": "1994", "publishedDate": "2025-11-06", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/f7O3SExW5mXhX5rO0D6h8u7vS6o.jpg", "verdict": "A warm and sweeping tale of American beauty that evokes deep romance.", "paragraphs": ["It's a real shame that we don't make movies like Legends of the Fall anymore. Despite maybe the problematic ways in which the Indigenous characters are portrayed in this movie and the dated, overly sweeping and grand stylization, there is a sense of romance behind it all that is just missing nowadays. You think about how we no longer have genuine lovers and how nobody seems sincere anymore. In the late 90s and early 2000s, with epic films that all sound so lovingly composed by Howard Shore, we had these sweeping stories of American beauty and tales of bravery that we simply don't get that much anymore.", "I'll keep my review brief, as there isn't much to comment on in this story. I will only talk about the way that this made me feel, which was aroused and excited, and in a way, very warm. It's a satisfying story of love, redemption, and family. I found it utterly intriguing from start to finish, and although it's even hard for me to point out specific details, I can only describe what it made me feel, which is often the most important thing a movie can do."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/legends-of-the-fall/umc.cmc.2l53j7n7f3z189scv18yofw9k"}
{"_type": "vaultReview", "_id": "vault-fury", "slug": {"_type": "slug", "current": "fury"}, "title": "Fury", "director": "David Ayer", "year": "2014", "publishedDate": "2025-11-07", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/m8yXQYp7mKkF1iVwL8H4f9r6Z0z.jpg", "verdict": "A cruel and simple-minded exploration of how war makes monsters of men.", "paragraphs": ["My dad loves World War II movies, and as a result, I have been exposed to many of them over the years. But recently, my attitude has changed significantly toward the portrayal of German soldiers during this time, simply because the facts of history are that many of these soldiers truly didn't know what they were fighting for. I think there's a level of oversimplification that makes it easy for films to slaughter thousands of Germans without having any sort of moral quandaries about it. Very few films have pronounced this issue as severely as David Ayer's Fury.", "it's in no way a decent portrayal of this and is instead an uncommonly cruel and simple-minded film about the horrors of war. As such, I can offer praise toward what it's very generally trying to get at, which is how war makes monsters of men. In this film, the American soldiers are aggressive, crude, and cruel, which feels like Ayer offering us a little bit of nuance in the story. But I simply find some of my biggest issues to come in the way that this violence is portrayed, which is nicely brutal but also doesn't seem to have very much meaning behind it.", "It's also a huge shame because the movie takes forever to get going. By the time we've actually reached the more interesting part of the film, which is what happens after these soldiers are stuck, it feels like we just spent a lot of time meandering. The epic kills of these soldiers were portrayed in a way that was massively disappointing and far too basic. it's easy to lose our humanity in times of struggle, which this film attempts to convey, but ironically, it feels like there isn't much of a sense of humanity in it at all."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/fury/umc.cmc.3yv30y7rlyv4u06p99990888"}
{"_type": "vaultReview", "_id": "vault-mulan", "slug": {"_type": "slug", "current": "mulan"}, "title": "Mulan", "director": "Tony Bancroft & Barry Cook", "year": "1998", "publishedDate": "2025-11-08", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "The gold standard for Disney musicals featuring an active and daring protagonist.", "paragraphs": ["Mulan is the gold standard for Disney musicals. This was a film I watched often in school on lazy testing days, but I haven't fully connected with it until now. Rewatching it as an adult, I’m struck by how incredible Mulan is as a protagonist. She’s active, intelligent, and daring. Instead of being the typical damsel in distress, she’s a warrior who saves everyone else.", "The avalanche sequence is the defining moment. She uses her brain to defeat an entire army, proving she’s smarter and more capable than every man on that battlefield. It’s a thrilling set piece that combines action, character growth, and visual spectacle. The montage sequences, especially I'll Make a Man Out of You, are legendary for a reason.", "The film is funny, sincere, and full of adventure, feeling like a real role model for young women and men watching it. It doesn't talk down to its audience. It balances the high stakes of war with the personal stakes of family honor effortlessly. It’s so effortlessly exciting that you can't help but sit back and smile."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/mulan/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-dunkirk", "slug": {"_type": "slug", "current": "dunkirk"}, "title": "Dunkirk", "director": "Christopher Nolan", "year": "2017", "publishedDate": "2025-11-09", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/2it70p9v99qf3s2gocv1bbt1r.jpg", "verdict": "A perfect film that explores the quiet complexities and terror of survival in war.", "paragraphs": ["There's a sense of profundity in Christopher Nolan's portrayal of World War II, which stems from the grandeur he brings to a relatively ordinary event. Plenty of films of this era explore the loudest and most exciting parts of the war, which usually consist of the senseless killing of German soldiers without any sense of nuance. But Nolan has a sense of respect and patriotism for the ordinary heroes of the war that makes it so far ahead of nearly any other film about the Second World War.", "Before I was into movies, I remember watching Dunkirk a few months after its theatrical run at a local dollar theater, and I didn't like it at all. I don't remember exactly what I didn't like about it, but I do remember being very frustrated at the whole thing. Years later, I rewatched it on my laptop, and as I have with every Christopher Nolan movie since, I fell in love with it. Being able to finally see it again in the theater has brought me a sense of understanding that you only get with the proper theatrical experience.", "The epistemological style of storytelling that Nolan takes makes every one of his films far more interesting than they might be on the surface. Hoyte van Hoytema‘s incredible cinematography somehow doesn't stand out nearly as much simply because of how phenomenal Hans Zimmer‘s score is. The relentless 105-minute score pulses through the entire film, bringing a sense of pacing so astounding that I checked my watch halfway through the movie and figured I must've accidentally set it ahead.", "All these little anecdotes aside, I think the thing I appreciate most about the film is Christopher Nolan's script, which explores the quiet complexities of war, including heroes and cowards, soldiers and villains. It poses a truly thought-provoking question: who do we become when we face our end? We see people acting through desperation, and yet the film seems to respect every one of its characters.", "I also love the way that the German soldiers are portrayed in the film, in that they are simply not given much portrayal at all. In some ways, you could be forgiven for thinking this is a Top Gun: Maverick-style situation where the enemy is purposely kept vague. Unlike Fury, which I despised for its portrayal of the soldiers in a way that was inhumane and one-dimensional, I appreciate the ways in which the enemy is portrayed here as this relentless and terrifying force of antagonism that is never given a face. It gets at the real point of war, which is not that all of these German soldiers deserve to die because the German army belonged to the Nazis, but instead that war makes monsters of us all, and it truly is the survival of the fittest. Portraying the Germans who get killed simply as these off-screen antagonists brings a level of fear and villainy to the Nazis as a whole, without having to shout in our face about their ideology.", "There is simply a way that Nolan manages to wrap up so many of his films on the most satisfying notes possible, and Dunkirk is no exception to that. I now feel comfortable adding this to my list of, in my opinion, perfect films. While it might not even be in the top five for Christopher Nolan, that is a comfortable reality for me, given my deep and enthusiastic appreciation for him and his contributions to the greatest medium of art."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/dunkirk/umc.cmc.2it70p9v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-zero-dark-thirty", "slug": {"_type": "slug", "current": "zero-dark-thirty"}, "title": "Zero Dark Thirty", "director": "Kathryn Bigelow", "year": "2013", "publishedDate": "2025-11-10", "ratingStars": "★★", "heroImage": "https://image.tmdb.org/t/p/original/149v99qf3s2gocv1bbt1r.jpg", "verdict": "A fascinating but ultimately letdown exploration of bureaucracy and capture.", "paragraphs": ["The film about Bin Laden‘s capture is a fascinating one because it's more about the bureaucracy than anything else. It's a bit of a letdown.", "it's a fascinating exploration of the bureaucratic ways in which we tried to take down Bin Laden in the wake of 9/11, but in a lot of ways, it doesn't feel particularly pointed, especially in the era that we are in right now. I think one of the biggest problems of any film set before Donald Trump's presidency, and especially Donald Trump's second presidency, is that the world has changed so much. After Mitt Romney lost and Trump won, the world now seems like an entirely different one.", "In a lot of ways, this film tries to explore the many ways in which we believe that the Middle East was really responsible for 9/11, when the truth of the matter is that there were other forces responsible for so much of this. I simply feel like I'm in a position where I can't mention any of that, but I don't fully believe the way that these terrorists were actually found. While I can understand the technical merit of it, I don't feel I appreciate the symbolic merit of it."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/zero-dark-thirty/umc.cmc.149v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-saving-private-ryan", "slug": {"_type": "slug", "current": "saving-private-ryan"}, "title": "Saving Private Ryan", "director": "Steven Spielberg", "year": "1998", "publishedDate": "2025-11-11", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A staggered piece of technical genius that is both terrifying and human.", "paragraphs": ["When I was younger, one of my least favorite films was Saving Private Ryan. I'm not sure why my dad thought it would be so appropriate for me to watch this unbelievably dreadful watch from Steven Spielberg, but I was a child then. I'm less of a pussy now, so I can appreciate the beauty and the power of the film. The simple, creative, and technical genius that goes into a movie like this is staggering. In a way, this is one of the most terrifying films in human history.", "It's told with this razor-sharp eye from Steven Spielberg that is so uncompromising and unsettling that, even though I still get very upset by this movie, it's a pure piece of genius. Seeing it on the big screen was a no-brainer. For every one of those upsetting, terrible fighting sequences, there is a glimmer of humanity that comes through. it's powerful in that way, a unique piece of film that is genuinely life-changing, something that sticks around forever, which is a rare feat given that every day I'm filling my brain with other films."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/saving-private-ryan/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-sidelined-the-qb-and-me", "slug": {"_type": "slug", "current": "sidelined-the-qb-and-me"}, "title": "Sidelined: The QB and Me", "director": "Justin Wu", "year": "2024", "publishedDate": "2025-11-12", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/m8yXQYp7mKkF1iVwL8H4f9r6Z0z.jpg", "verdict": "An unbelievably stupid and silly film that warrants its position as a Tubi original.", "paragraphs": ["Look, I'm interviewing Noah Beck and Siena Agudong for the sequel, so I'm not going to act like I watched Sidelined: The QB and Me for any other reason except the fact that I was doing this interview. Simply, I will say that I acknowledge the ways that it's pretty funny, and it's sort of fascinating how unbelievably stupid and silly it's. However, I did watch it for a specific reason: to obtain a review of an interview with these two people.", "I don't think the film was particularly good. I don't think Noah Beck and Siena Agudong are particularly skilled actors, but I do believe the film was funny enough to warrant a position as a Tubi original. It probably receives some sort of award for its achievements and generates a number of sequels, as I believe it's essential to produce a series of films that are similar to those you can watch on a vertical format. Not necessarily equity form, but like one of those episodic formats where it's just a bunch of bullshit happening, and maybe it's a little bit erotic for teenagers. I sort of understand the appeal of that, but that's about it."], "footerText": "Watch on Tubi", "footerLink": "https://www.amazon.com/Sidelined-QB-Me-Siena-Agudong/dp/B0D1N9N9X6"}
{"_type": "vaultReview", "_id": "vault-in-your-dreams", "slug": {"_type": "slug", "current": "in-your-dreams"}, "title": "In Your Dreams", "director": "Alex Woo & Erik Benson", "year": "2025", "publishedDate": "2025-11-13", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/81031172.jpg", "verdict": "An ugly animated movie with a generic story and frustrating production logistics.", "paragraphs": ["I'll cut to the chase: I did not like In Your Dreams one bit. it's one of the ugliest animated movies of the year with a terrible, generic story. I didn't like a bit of it. I will use this as a platform to rant about an interview I gave. I had the opportunity to interview Alex Woo, who directed the film, which was a nice experience. You can read that here. He was kind and sincere, and I enjoyed speaking to him. My complaint is in no way about him. It's about the way that Netflix publicity handles interviews.", "If you're reading this and are unaware of how these interviews work, my editor or I will connect with you via large, fielded-out emails that will explain the availability on a certain day. Typically, they'll give you a specific time slot. I hop into a Zoom call and give around eight-minute interviews on average. But for this film, they gave me four minutes to speak to the director. Four minutes already buys you almost no time, which I thought was absurd, especially given that I'm not interviewing one of the stars. I'm interviewing the director, who's never made a movie before, so why should I have to limit my speaking time to four minutes? Anyway, I get in there, and they cut me off three minutes in. I don't even get to four minutes! It's insane. That really bothered me. Typically, there's a reverse effect where I will see a movie that sucks and then I'll really enjoy my interview, so I'll give it a higher score simply because in my head a positive memory is attached. But I hate this movie. This whole ordeal really pissed me off. Sorry for the rant, but sometimes I feel like it's just time to be honest."], "footerText": "In Your Dreams is in theaters now", "footerLink": "https://www.netflix.com/title/81031172"}
{"_type": "vaultReview", "_id": "vault-the-family-man", "slug": {"_type": "slug", "current": "the-family-man"}, "title": "The Family Man", "director": "Brett Ratner", "year": "2000", "publishedDate": "2025-11-14", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A sweet, sincere, and emotional film that brings much warmth.", "paragraphs": ["Regal continues its November series, and I get increasingly busy. I am seeing far fewer films that I want to see in theaters, so I have been watching them at home on my own. As an easy way to decide which movie to see, I watched The Family Man. I really wish I had seen this film in theaters. I loved this. I loved the saccharine silliness and emotional nature of the film. Nicolas Cage plays this rich asshole who gets transported to a life where he stays with a former lover of his and becomes a Family Man™.", "It's a basic premise, but this just brought me so much warmth. it's such a kind movie. it's so sincere. Nicolas Cage is incredible. It's funny, sweet, and emotional, and something I adored completely. Honestly, I adored this movie. I loved it. This is so sweet."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-family-man/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-hugo", "slug": {"_type": "slug", "current": "hugo"}, "title": "Hugo", "director": "Martin Scorsese", "year": "2011", "publishedDate": "2025-11-15", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A masterfully directed love letter to cinema that suffers from excessive length.", "paragraphs": ["Filmmaking, being such an independently storied medium of art, allows for many rich films about its own history. Hugo is one of those films, a masterfully directed love letter to the history of itself, or of the medium of film in general. it's a remarkable and first-rate piece of filmmaking; there are no real doubts about that. Through the eyes of an orphan boy living in a train station, we see the way that film manages to impact so many and how, at an important time during its inception, it found a special and specific point in humanity that it still holds today, in perhaps a small way, but still a significant one. When I watch films like this, I am often reminded of why I want to get into film, and I find the nature of grand films like this exciting and fun to watch.", "I find, though, that out of Scorsese's filmography, this is one of his least pointed films. Through the exploration of Georges Méliès, we gain a vibrant and amazing story about moviemaking and the wonders and magic it embodies, but in the pursuit of an expensive film, it loses much of its edge. The film itself feels like it takes too long to find its own identity. The obvious mystery of who Hugo is supposed to be is an important one to consider, but this is simply a film that needs to be specific about its story. Instead, we spend time on these exotic adventures and tertiary side plots that ultimately contribute little, if anything at all. Through these ancillary side plots, it's oftentimes a trap for these incredible filmmakers not to be afraid to trim when necessary.", "Obviously, there's a silliness about myself criticizing Scorsese in this way, but while so many of his films do justify the lengthy runtimes, this is simply a film that could've worked at 90 minutes long. Or, if it insists on being two hours, a stronger focus on the life of Méliès would've worked far better. The film becomes so frequently distracted that it loses a lot of its bite. Although it manages a rich level of emotion due to Scorsese's expertise as a director, it feels like, although this is a great product, it would've been far better if there were more focus on what the heart of it's. I am so often deterred from watching so many of these great films simply because of the runtime, and while that is an unhealthy habit as a film critic, I find a film like Hugo to be a strong example of that: something that has lots of great moments but is seriously hindered through its lengthiness."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/hugo/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-wonka", "slug": {"_type": "slug", "current": "wonka"}, "title": "Wonka", "director": "Paul King", "year": "2023", "publishedDate": "2025-11-16", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A joyful and humorous fantasy that falls short in technical execution.", "paragraphs": ["I'm actually going to keep this review rather short because I do enjoy Wonka quite a bit and I do not want to tear into it, but I will keep the facts very clear. I am bumping this film down from a perfect score to a nine out of 10 and holding it back from an eight out of 10 only because I previously loved it as a 10 out of 10.", "Here is the thing: for everything Wonka does incredibly well, which includes the joy, humor, and Roald Dahl's sense of fantasy, the film falls short in miscast performances, terrible CGI, and poor writing. The film could be five times better than it's, but it simply is not. It looks a little bit stupid, and it treats itself like it doesn't truly want to be a part of the canon, and for that reason alone, I will be bumping it down. This movie has meant a great deal to me, but it's time for me to acknowledge the facts. I had a fantastic time, and I think Timothée Chalamet's performance as Willy Wonka is truly outstanding. I can't wait to see what he does next, but it doesn't deserve a perfect score. Point blank, period. End of story, as Baker would say."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/wonka/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-greatest-showman", "slug": {"_type": "slug", "current": "the-greatest-showman"}, "title": "The Greatest Showman", "director": "Michael Gracey", "year": "2017", "publishedDate": "2025-11-18", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "An exciting and inventive musical about human expression and creativity.", "paragraphs": ["Ever since I watched The Greatest Showman, there has been a part of me that wants to declare it as one of the most exciting and inventive films of musicals that I have ever watched. But I always put it to the side because of its mediocre reception from critics. Only a few years later, after having been a professional critic for so long and someone who is a somewhat substantial voice in the community, I've realized that these opinions don't matter at all. Simply, one of the most important parts of all of it's the way that I feel about the movies that I watch.", "For almost every single musical I see, I always compare it to this film in a way that I think about how the music holds up, maybe a level of catchiness or maybe a level of profundity. Every single time, I feel like, if the film itself, outside of all the musical stuff, is decent enough, then it's somehow better than this, only because P.T. Barnum is a pretty bad guy, and I must expect him to be portrayed that way, right? But instead, I see through that and realize that this is a film about human expression and creativity that has thrived on a level that almost no other film ever has, and brings me a level of joy that almost no film ever does.", "For that specific reason, I will be bumping it to the perfect score that, in my humble opinion, I believe that it deserves. It's a little unfortunate that it comes at the time that I have to take another film down from the five-star rating that I previously gave it, but I do believe that the songs by Pasek and Paul are so incredible that the film simply deserves a level of recognition that I have not previously offered to it."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-greatest-showman/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-corpse-bride", "slug": {"_type": "slug", "current": "corpse-bride"}, "title": "Corpse Bride", "director": "Tim Burton & Mike Johnson", "year": "2005", "publishedDate": "2025-11-19", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A daring animation with an aesthetic that makes me viciously uncomfortable.", "paragraphs": ["I'm not exactly a fan of this animated style of film from Tim Burton. I've never found his aesthetics particularly appealing, and for that alone, I was not a huge fan of Corpse Bride. Unfortunately, while it's a fun little story neatly told by Tim Burton and the other director, it made me viciously uncomfortable with just the way it was animated. I know that this is a shallow piece of film criticism in that way, but I just wasn't able to properly engage with it. It's very British, I guess, in that way; there's a very specific sense of dread and weirdness to it. It's weird, and I don't like that sometimes.", "Overall, I think that it's fine; quite interesting and daring, and I appreciate the effort that goes into creating this animation. It's just not exactly my thing. I think that's just a thing I have against Tim Burton in general, or these late 90s / early 2000s animated films that went with the aggressively original looks."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/corpse-bride/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-emperors-new-groove", "slug": {"_type": "slug", "current": "the-emperors-new-groove"}, "title": "The Emperor's New Groove", "director": "Mark Dindal", "year": "2000", "publishedDate": "2025-11-20", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A simple and silly Disney adventure that feels less compelling to adults.", "paragraphs": ["I'm clearing through some of the Letterboxd One Million Watched list for films that I haven't seen before. The Emperor's New Groove is one of those Disney movies that's a little silly. It has this big sense of adventure, lots of animals, weird gags, and funny bits. In some ways, I find it a very simple piece of entertainment, not one that I engage with on such a serious level.", "I think this is one of those films that, if you see it when you're a kid, you would like a lot more, but as an adult, it's just less interesting to me. It's less compelling in that way than films like A Goofy Movie, for example. At the same time, these films are sort of meant to be seen when you're a child, so watching this as a college student, just sitting on my computer, is one of the least compelling ways to watch it."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-emperors-new-groove/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-chicken-little", "slug": {"_type": "slug", "current": "chicken-little"}, "title": "Chicken Little", "director": "Mark Dindal", "year": "2005", "publishedDate": "2025-11-21", "ratingStars": "★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A weak and annoying Disney film with ugly design and unfunny jokes.", "paragraphs": ["For some odd reason, I've always felt like I've had to defend Chicken Little. I thought that it could be one of those ironically funny failures, maybe like Bee Movie, that I might genuinely enjoy. But obviously, looking back on it now, I realize that it's just not a good movie at all.", "It's not funny. It's weird. It's painfully dated. It's annoying. I hate the alien stuff that it leads into. I just don't like the way the plot progresses at all. The jokes aren't funny. The character design is ugly. It's easily just a weak and dumb Disney film that I will forget about immediately. The only saving grace is that it's 81 minutes long."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/chicken-little/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-nightmare-before-christmas", "slug": {"_type": "slug", "current": "the-nightmare-before-christmas"}, "title": "The Nightmare Before Christmas", "director": "Henry Selick", "year": "1993", "publishedDate": "2025-11-23", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "An eccentric stop-motion experiment with unsettling visuals that fail to engage me.", "paragraphs": ["OK, I'm just gonna say it. I don't really like Henry Selick's movies that much, except for Coraline, which I do find to be pretty good. With a film like Corpse Bride, I feel like I'm kind of just giving a more positive review because I don't want to seem like an asshole, but I know this is really not my thing at all.", "I find some of the humor to be pretty good, but again, this is an eccentric style of comedy that has never clicked with me. For the life of me, I just don't get it. In some ways, that's not really a fair way to review movies. But at the same time, because film is such a subjective medium, it allows for “bad” criticism to also be valid. I'm not getting anything particularly strong here, which I wish I... well, actually, let me try to get out what I don't like about it.", "I find this style of British, very dry, visually creepy imagery to be unsettling. The stop-motion style has never really been for me as a visual medium. I know it takes so much hard work to make happen, but often I feel like it doesn't produce results that are visually astounding in my eyes. It's sort of like watching an artist who paints with something impossible like toothpicks. I can understand the creative appeal, but I also recognize that other forms of painting are more visually appealing. So it's a simple thing, but because the visuals make me uncomfortable, I dislike the entire product. In my eyes, that's a valid enough excuse."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-nightmare-before-christmas/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-pocahontas", "slug": {"_type": "slug", "current": "pocahontas"}, "title": "Pocahontas", "director": "Eric Goldberg & Mike Gabriel", "year": "1995", "publishedDate": "2025-11-25", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A beautiful veneer that suffers from historical erasure and formulaic romance.", "paragraphs": ["Pocahontas looks like a classic Disney movie with lush animation and sharp character designs, but beneath that beautiful veneer, there are obviously questionable elements that are hard to ignore. It’s ambitious and mature in its tone, but it suffers from a fatal flaw: reality. It’s difficult to separate the film from the whitewashing and erasure of the brutality the real Pocahontas faced.", "The Colors of the Wind sequence is the perfect example. It’s visually stunning and musically beautiful, but it feels hollow. It feels like the movie is play-acting at depth while ignoring the actual genocide that followed. It’s presentism, sure, but it’s also just a distraction. You’re watching a fantasy version of history that feels a little too convenient.", "John Smith isn't an interesting character. He lacks subtlety, and the romance feels forced and formulaic. Disney's habit of creating comically evil villains and cute sidekicks feels by-the-numbers here. It’s surprising that just a few years later, the same studio would make Mulan, which corrects almost every single problem present here."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/pocahontas/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-holdovers", "slug": {"_type": "slug", "current": "the-holdovers"}, "title": "The Holdovers", "director": "Alexander Payne", "year": "2023", "publishedDate": "2025-11-26", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A timeless Christmas story featuring generational directorial effort and superb acting.", "paragraphs": ["It's hard to put into words how much I deeply adore The Holdovers. Even though it came out just two years ago, it feels like every watch brings out new emotions in me. It already feels so timeless and fresh. Maybe that is a quality of Christmas movies that makes them so good: they have this rewatchability where they can simultaneously be exciting, original experiences every time but also have a sense of timelessness.", "The way in which Alexander Payne crafts this loving Christmas story of curmudgeonly professors, asshole students, and lonely lunch ladies is truly a generational directorial effort. It's a shame that it had to be released in the same year as Oppenheimer because Paul Giamatti would've been one of the greatest Oscar winners ever. But put next to Cillian Murphy, it gets a little difficult. Giamatti would've been one of the best of the decade if he weren't put with another performance that was the best of the decade.", "Da'Vine Joy Randolph... it's a bit of a shame seeing some of the smaller, more comedic roles she's taken on since this, because her talents are far beyond anything that she's doing. I think she was a comedian before, so it does take years for the actual post-Oscar résumé to come across. I am still excited to see the project that she takes on next. She's truly such a superb actress in a generational film, alongside a landmark debut performance from Dominic Sessa. It's a film that is a culmination of so many wonderful things. Once again, it's a phenomenal holiday watch, even if I'm seeing it again in the theater in November for some reason."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-holdovers/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-three-billboards-outside-ebbing-missouri", "slug": {"_type": "slug", "current": "three-billboards-outside-ebbing-missouri"}, "title": "Three Billboards Outside Ebbing, Missouri", "director": "Martin McDonagh", "year": "2017", "publishedDate": "2025-11-26", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A respectful and sharp film about trauma backed by sublime performances.", "paragraphs": ["Thorin was watching Three Billboards Outside Ebbing, Missouri and I have such fond memories of this film that I was able to pretty much stop what I was doing and immediately put it on.", "I'm happy as always whenever I see a movie that I have given five stars to. I'm a little apprehensive of rewatching because I am always worried that I will like it less on a new watch than I did on a previous one. But I'm happy that this movie lived up to all of my previous expectations, and this rewatch was very rewarding.", "I love the way that Martin McDonagh directs this film about a town reeling from the brutality of a rape and a murder. It feels so respectful of all of its characters and is daring, funny, sharp, and witty, but also not mean. It's a compelling story backed with some of the most sublime performances in so very long. Frances McDormand and Sam Rockwell in particular are just utterly captivating and fantastic on screen. It's great watching so many years later. I'm happy that it still holds as a favorite film of mine."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/three-billboards-outside-ebbing-missouri/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-being-there", "slug": {"_type": "slug", "current": "being-there"}, "title": "Being There", "director": "Hal Ashby", "year": "1979", "publishedDate": "2025-11-27", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A quirky dry comedy that suffers from excessive length and bizarre shifts.", "paragraphs": ["My dad has always been a proponent of these weird old films that I've never really heard of. He gave a strong recommendation for Being There, a quirky film about a mentally disabled person who embarks on a journey of wealth and power, serving as an interesting relic of its time.", "There's a lot of dry humor in it, and it mostly works. But when it starts to lean into the weird sexual stuff, it feels like it gets to this bizarre level of seriousness that I didn't like, and it kind of takes away from the experience. That's also the problem with a movie like this being two hours and 10 minutes long, when it really should've been 100 minutes at most. One of the things that intrigued me the most was the way it ends with him walking on water. I'm not entirely sure how to interpret that, and it's something that has stuck with me for quite some time afterward."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/being-there/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-influencer", "slug": {"_type": "slug", "current": "influencer"}, "title": "Influencer", "director": "Kurtis David Harder", "year": "2023", "publishedDate": "2025-12-01", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/B8K3R8J3.jpg", "verdict": "A restrained and intense horror film that looks surprisingly good for its budget.", "paragraphs": ["Influencer is a surprising film. I'm interviewing Kurtis David Harder in a few days for the sequel, Influencers, so I decided to watch this so I'd be prepared. I think the thing that surprised me the most about it was just how good it looks for the budget. It's such a restrained and intense horror film that looks infinitely better than most other horror movies made today.", "It has a surprising sense of grandeur to it all, with stylish performances, fantastic cinematography, and great editing. it's surprising that Kurtis has managed to make it so far as a young person in the industry because he does understand how horror works and understands how to build up the scares. I like the cat-and-mouse element of it all and enjoy the way that we follow the villain through the narrative.", "The thing that I struggle the most with is these unsatisfying endings. In no uncertain terms, I was unsatisfied by the death of our male protagonist at the end. I thought that was kind of a cheap moment of horror, but I do find the character of CW to be compelling. Being able to see the conclusion right before I watch the second one, instead of having to wait two years in between, is nice, so I'm able to be a bit happier with it."], "footerText": "Rent or buy on Amazon", "footerLink": "https://www.amazon.com/Influencer-Emily-Tennant/dp/B0B8K3R8J3"}
{"_type": "vaultReview", "_id": "vault-incontrol", "slug": {"_type": "slug", "current": "incontrol"}, "title": "Incontrol", "director": "Kurtis David Harder", "year": "2017", "publishedDate": "2025-12-04", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/7996S5Z5.jpg", "verdict": "An unfocused but interesting directorial effort exploring technology and betrayal.", "paragraphs": ["Because I'm interviewing Kurtis David Harder this morning, I decided to watch the two other films on his credits that I can actually access, the first being his first film available online, Incontrol. it's a sort of Christopher Nolan prototype film, a thriller about individuals who can take over the bodies of others, and the consequences that follow, as well as the way they treat each other.", "If there is some interesting commentary on it, it's a very unfocused film. It's clear that Kurtis is still learning at this point, but you get to see some of the early strands of DNA in this film that allow us to see the ways that he thinks about the world, technology, people, betrayal, and all these other things, which are genuinely very interesting tropes. All things considered, it's a rather interesting film. I didn't exactly follow every bit of it as much as I would like to, but I do think it's a fantastic directorial effort for somebody as young as him."], "footerText": "Rent or buy on Amazon", "footerLink": "https://www.amazon.com/Incontrol-Levi-Meaden/dp/B07996S5Z5"}
{"_type": "vaultReview", "_id": "vault-spiral", "slug": {"_type": "slug", "current": "spiral"}, "title": "Spiral", "director": "Kurtis David Harder", "year": "2019", "publishedDate": "2025-12-04", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/B08JJMC1Y6.jpg", "verdict": "A meandering stumble that leans too heavily on familiar horror conventions.", "paragraphs": ["I've now completed the filmography of Kurtis David Harder with Spiral, which is arguably his most notable film, but in my opinion, one of the weaker ones. We discussed this during our interview. He played into many familiar horror conventions, and, as I'm not a huge fan of horror in general, it falls into the annoying trope of unbelievable events. The main character is consistently agonizing and kind of doesn't seem to have much of a point.", "It's a rather meandering film, unfortunately, which is a shame because it's clear that Kurtis has become a much better filmmaker since then. So this is maybe the biggest stumble of his career, but still, at times, an interesting film."], "footerText": "Rent or buy on Amazon", "footerLink": "https://www.amazon.com/Spiral-Jeffrey-Bowyer-Chapman/dp/B08JJMC1Y6"}
{"_type": "vaultReview", "_id": "vault-zoolander", "slug": {"_type": "slug", "current": "zoolander"}, "title": "Zoolander", "director": "Ben Stiller", "year": "2001", "publishedDate": "2025-12-05", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "An absurdly consistent comedy that embraces its own stupidity with commitment.", "paragraphs": ["It’s fascinating to see a movie lean so heavily into its own stupidity. Zoolander works because it embraces its quirks with zero hesitation, and Ben Stiller proves himself to be a great comedic director here. He creates a tone that’s absurdist but consistent. Derek Zoolander is one of the most hilarious characters ever put to screen, playing the narcissist idiot with such commitment that you can't help but root for him.", "The files are inside the computer scene is the peak of this stupidity. It captures the essence of the film: characters who are so dumb they loop back around to being endearing. Stiller and Owen Wilson have fantastic chemistry, playing off each other perfectly, and Will Ferrell is unhinged as Mugatu, bringing a manic energy that elevates every scene he’s in.", "A lot of indie comedies try to manufacture this kind of weirdness and fail, but Zoolander succeeds because it feels genuine. It’s a glimpse into a lobotomized world where male models are the most important people on earth. It’s loud, aggressive, and undeniably funny."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/zoolander/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-messenger", "slug": {"_type": "slug", "current": "the-messenger"}, "title": "The Messenger", "director": "Oren Moverman", "year": "2009", "publishedDate": "2025-12-06", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A devastating character study marred by a horrible and ethically gross romance.", "paragraphs": ["The Messenger is a film about casualty notification officers, a premise that feels engineered to be emotionally devastating like a sad car crash compilation on YouTube. And it's devastating. The one-take notification scenes are the highlight of the film because they’re real, raw, and showcase excellent acting from Ben Foster and Woody Harrelson.", "I find it intriguing that the film avoids overt political commentary about the war itself, focusing entirely on the human cost at home. This allows it to stand on its own as a character study rather than a polemic. However, the film collapses whenever it steps away from the job. The romance subplot is horrible.", "Ben Foster’s character starts a relationship with a widow he notified, and it feels ethically gross. She’s established early on as a cheater, so she isn't particularly sympathetic, and he’s crossing a massive professional line. Every time the movie focuses on this romance, it grinds to a halt. It’s jarringly dumb, and you find yourself wishing the movie would just go back to the notifications to escape the bad writing of the love story."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/the-messenger/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-evil-dead-ii", "slug": {"_type": "slug", "current": "evil-dead-ii"}, "title": "Evil Dead II", "director": "Sam Raimi", "year": "1987", "publishedDate": "2025-12-08", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A frantic hybrid of terror and slapstick violence that demands total buy-in.", "paragraphs": ["The Evil Dead franchise feels like something I'll probably never fully understand because every film takes a random shot in a completely insane direction. In Evil Dead II, Sam Raimi decides to throw the window out entirely and just go for broke. The opening recap threw me off a little bit since it basically rewrites the first movie on the fly to suit the new tone. I quickly realized that nobody's really supposed to give much of a shit about the specific plot consistency here. Everything revolves around the manic energy and watching Bruce Campbell lose his mind in that cabin. He's undeniably fascinating to watch as he descends into a mix of terror and slapstick violence that only he can pull off.", "The camera work feels so exciting and frantic that the lens practically becomes its own character in the story. Every shot looks like it’s lunging at you. While the slapstick and gore are well done, the experience is the kind of thing where you have to get the joke to really love the result. Some of the gags didn't fully work for me because they felt a bit too repetitive, but seeing a straight horror film translated into this weirdly hilarious hybrid stays interesting. This creative and bizarre trip feels like Sam Raimi at his most unhinged.", "The film serves as a reminder of a time when directors could just experiment with a medium and see what stuck to the wall. There’s a sense of handmade craft in the special effects that you just don't see anymore in the era of digital polish. Even when the logic fails, the sheer inventiveness of the gore keeps you looking at the screen. It’s a loud and aggressive movie that demands you meet it on its own level of insanity. I don't know if I'll ever be a superfan of the series, but I respect the hell out of the audacity on display."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/evil-dead-ii/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-lurker", "slug": {"_type": "slug", "current": "lurker"}, "title": "Lurker", "director": "Alex Russell", "year": "2025", "publishedDate": "2025-12-09", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/DJLURKER.jpg", "verdict": "A sledgehammer approach to the imposter thriller that wallows in unearned misery.", "paragraphs": ["We need to call a moratorium on the Imposter Thriller. We have seen enough films about socially awkward outsiders infiltrating the lives of the rich and famous. The Talented Mr. Ripley did it with class. Saltburn did it with... popularity. Lurker does it with a sledgehammer. The trend is exhausted. This film offers nothing new to the conversation about parasocial relationships or the toxicity of fame. It just wallows in the misery of it all. You finish watching a film like The Talented Mr. Ripley and feel unsettled but impressed. You finish Lurker and just feel depressed.", "The problem lies squarely with the protagonist. Usually, an antihero needs a seductive quality. We need to understand why people let him into their lives. Matthew (Théodore Pellerin) is a black hole. He starts as a retail worker and blackmails his way into a pop star's entourage. He has no charm. He has no wit. He is just a leech. The movie asks us to spend nearly two hours with a character who is devoid of any redeeming human traits. He is not a character you love to hate. He is a character you just hate.", "The waste of talent is criminal. Havana Rose Liu is excellent. She has a natural light and charisma that commands a room. The film manages to smother that completely. She plays a member of the entourage, but the script gives her nothing to do but react to Matthew’s awfulness. Archie Madekwe is actually quite good as the pop star Oliver, finding a balance between ego and vulnerability. The movie does not care about them. It traps these dynamic actors in a script that refuses to let them breathe.", "Misery porn requires a money shot. If you are going to drag the audience through the mud, you need to show us something profound at the end. Lurker offers no such insight. The film ends with Matthew stammering through a Q&A after his documentary premieres. It's meant to be ambiguous. It feels cowardly. The director, Alex Russell, seems to think that making a character unlikable is a substitute for making him interesting. it's not. Watching a terrible person do terrible things to undeserving people is not a thriller. it's just a bad time."], "footerText": "Lurker is in theaters now", "footerLink": "https://www.amazon.com/Lurker-Theodore-Pellerin/dp/B0DJLURKER"}
{"_type": "vaultReview", "_id": "vault-shark-tale", "slug": {"_type": "slug", "current": "shark-tale"}, "title": "Shark Tale", "director": "Vicky Jenson, Bibo Bergeron, & Rob Letterman", "year": "2004", "publishedDate": "2025-12-10", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A symptomatic product of its time with uncanny visuals and weak heart.", "paragraphs": ["The early 2000s stands out as one of the weaker eras for animated films and Shark Tale works as a perfect example of why that’s the case. The uncanny visuals haven't aged well at all because the character designs look like they’re trying too hard to mimic the celebrities voicing them. That choice makes the whole thing feel dated and strange. The constant barrage of pop culture references feels incredibly tired by now as well. What I like least is how unlikable Oscar remains as a protagonist throughout the entire runtime. He’s a liar and a narcissist who isn't very easy to root for at any point.", "The film relied mostly on its massive voice cast to do the heavy lifting for a weak script. Having someone like Martin Scorsese play a pufferfish is a funny idea on paper, but the bit doesn't really work if the writing stays this thin. The humor mostly relies on puns that lose their charm after the first five minutes. The movie functions as a satisfying enough story that doesn't overstay its 90 minute welcome, but the project just feels like a symptom of its time rather than a classic.", "There’s not much heart underneath the flashy colors and the celebrity cameos. You spend the whole movie waiting for Oscar to show some genuine growth, but he mostly just stumbles into success. The world building feels shallow and the animation lacks the fluid grace of better Dreamworks projects. It’s a movie that exists because a studio wanted a hit, not because someone had a story they needed to tell. I found the whole experience to be more of a chore than a joy. It doesn't feel fully fleshed out in a way that works anymore, especially when you compare it to the stuff Pixar was doing back then."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/shark-tale/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-earth", "slug": {"_type": "slug", "current": "earth"}, "title": "Earth", "director": "Alastair Fothergill & Mark Linfield", "year": "2007", "publishedDate": "2025-12-14", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A bleak nature documentary that feels redundant compared to modern technical standards.", "paragraphs": ["I was looking for a little documentary to watch while on a cruise and I found Earth to be surprisingly less compelling than I wanted. Watching animals getting killed is the nature of the beast in these things, but other projects have done the job so much better. This version felt a bit redundant after seeing so many high quality nature shows on television lately. I wanted a level of wholesomeness or at least some visual wonder that I just wasn't getting from this particular edit. Compared to something like the Planet Earth series, the footage here feels remarkably muddy and lacks the crisp detail I expected.", "The narrative felt a little too depressing for a vacation watch because the focus stays so heavily on the struggle for survival in a dying world. The ending where the polar bear succumbs to his injuries is especially gut-wrenching and left me feeling cold. The film stays effective and probably genre-defining in its own way, but this wasn't the peaceful nature film I was hoping for. If you want a nature fix, there are more beautiful ways to get the job done than this fifteen year old theatrical cut. We've become spoiled by the incredible advancements in camera technology over the last decade, and looking back at this film makes you realize how far the medium has come.", "The colors don't pop and the scale doesn't feel as grand as it should. It’s an honorable attempt to bring the majesty of the planet to the big screen, but the experience feels like a relic of a previous era. I appreciate the message it tries to send about conservation, but the delivery felt a bit too heavy handed and bleak for me to truly enjoy. The pacing can be a bit of a slog, and the lack of a charismatic narrator like David Attenborough makes the dry segments feel even longer. It’s a fine documentary if you haven't seen the better ones, but otherwise, it’s hard to stay engaged."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/earth/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-f1", "slug": {"_type": "slug", "current": "f1"}, "title": "F1", "director": "Joseph Kosinski", "year": "2025", "publishedDate": "2025-12-15", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/kosinski-f1-backdrop.jpg", "verdict": "A visceral racing drama that effectively captures the terrifying noise and speed.", "paragraphs": ["For my first time seeing a racing film like F1 in a theater, I was prepared to be let down by the narrative. I assumed the excitement would only come from the visceral noise of the cars. I was surprised at how well the drama plays. There’s a trade-off with these films where the small human moments feel tiny on a big screen, but the racing feels massive. The sound design is incredible, creating an atmosphere where the cars feel terrifyingly loud.", "The most exciting part is just how well the racing is captured. I’ve never watched a second of Formula One sport in my life, yet I was drawn into the mechanics of it. Brad Pitt is at his best here as Sonny Hayes, bringing a movie-star charisma that anchors the film. Director Joseph Kosinski understands how to film speed. He proved it with Top Gun: Maverick, and he proves it again here.", "It’s an entertaining journey that manages to be a complete delight. The use of Lose My Mind by Don Toliver is perfectly timed and hyped me up completely. It’s a sweet, exciting film that works even if you don't know a pit stop from a penalty kick."], "footerText": "F1 is in theaters now", "footerLink": "https://www.apple.com/apple-tv-plus/"}
{"_type": "vaultReview", "_id": "vault-iron-man", "slug": {"_type": "slug", "current": "iron-man"}, "title": "Iron Man", "director": "Jon Favreau", "year": "2008", "publishedDate": "2025-12-16", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A grounded superhero origin story with tactile action and charismatic performance.", "paragraphs": ["Rewatching Iron Man reminds me exactly why this whole thing worked. Jon Favreau did a fantastic job directing a superhero movie that actually feels grounded in reality. The first flight test with the Mark II suit still feels more tactile and real than anything in modern Marvel because you can see the weight of the metal. The CGI is mind-bogglingly good for a movie from 2008 and Robert Downey Jr. is simply incredible as Tony Stark. He owns every second he’s on screen.", "Favreau’s direction is the secret sauce here since there’s a relentless sense of fun that breaks away from the grittiness of earlier superhero films. The origin story is fascinating to watch as the drama unfolds in the desert cave. Even if Obadiah Stane isn't the most fantastic villain and Pepper Potts isn't given much to do, the film still succeeds. That movie stays a great way to anchor a series that would eventually change the entire industry.", "The balance between the technological exploration and the character growth is what makes the film stand out from the crowd. The plot doesn't feel like it’s setting up ten other movies; the script just tells a great story about a man trying to do better. The action feels clear and the stakes stay personal rather than cosmic. This movie reminds me that superhero movies used to be about people instead of just multiverses and cameos."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/iron-man/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-roman-j-israel-esq", "slug": {"_type": "slug", "current": "roman-j-israel-esq"}, "title": "Roman J. Israel, Esq.", "director": "Dan Gilroy", "year": "2017", "publishedDate": "2025-12-17", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A missed opportunity that relies heavily on character tics rather than narrative depth.", "paragraphs": ["Denzel Washington is obviously very good in this because he’s one of the best to ever do it, but I’m not sure the role’s actually worthy of his talents. He embodies all these specific character tics in the titular Roman J. Israel, Esq. the way he walks and talks, but after a while the performance feels more like a collection of traits than a real person. I expected a meaty courtroom drama that would let him chew the scenery, but instead the story turns into this weird ethical thriller.", "The film is full of placeholder characters who don't really matter to the central plot at all. They just kind of drift in and out of Roman's life without leaving a mark. The whole conceit of his downfall feels a bit odd and unearned by the time the credits roll. Denzel’s performance is the only thing that keeps the movie afloat during its slower moments. Even then, the character feels a little too much like a collection of tics rather than a deep soul.", "This two hour experience doesn't feel particularly long, but the result stays a missed opportunity. I wanted more of the legal system and less of the weird ethical dilemma that doesn't quite land. The direction feels a bit aimless and the ending is especially frustrating because the script doesn't offer much resolution. Denzel tries his best to pull it all together, but the writing just isn't there to support him."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/roman-j-israel-esq/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-erin-brockovich", "slug": {"_type": "slug", "current": "erin-brockovich"}, "title": "Erin Brockovich", "director": "Steven Soderbergh", "year": "2000", "publishedDate": "2025-12-18", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A bland visual presentation that relies entirely on a fantastic lead performance.", "paragraphs": ["It’s surprising that Steven Soderbergh got an Oscar nomination for Erin Brockovich because the project stays a pretty bland movie on a visual level. I love his work and he usually has a gritty realism that elevates a story, but this one just looks like a TV movie despite the high-caliber acting. Julia Roberts is undeniably fantastic as the lead, though. She plays the trashy but brilliant paralegal with a lot of subtlety and makes the legal work seem exciting.", "The script by Susannah Grant is probably the best part of the whole production since she strips the story down to make the legal jargon actually make sense. I just didn't really buy into the melodrama of it all as the film went on. The supporting cast is so generally dull that the film doesn't feel like it’s achieving much beyond being a showcase for its star. The movie is a solid biopic and a meaningfully small story, but the execution isn't very interesting.", "I found the stakes a bit hard to get invested in because the visual style is so flat. The film lacks the punch that his other projects usually have. Even though the story matters and the central performance is great, I found myself checking out during the more emotional beats. The script tries too hard to make me feel something that the images aren't earning. It’s a decent enough watch if you like biopics, but the film doesn't stand out."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/erin-brockovich/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-tarzan", "slug": {"_type": "slug", "current": "tarzan"}, "title": "Tarzan", "director": "Kevin Lima & Chris Buck", "year": "1999", "publishedDate": "2025-12-19", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A kinetic and technical marvel that moves with infectious energy.", "paragraphs": ["Sometimes it’s important to have a quick pick-me-up, and Tarzan delivers that excitement in spades. This film is a technical marvel. The use of the deep canvas technology allows for dynamic camera movements that 2D animation rarely achieves. The way Tarzan moves, surfing through the trees like a skateboarder, is one of the most interesting pieces of character animation in Disney history. It gives the film a kinetic energy that’s infectious.", "It’s a classic adventure story for a reason. It’s fun, fast, and visually sweeping. The soundtrack by Phil Collins is, of course, legendary and does a lot of heavy lifting for the emotional beats. However, the film does suffer from some one-dimensional characters. Clayton is a boring villain, and the romance between Tarzan and Jane is decent but feels a little rushed.", "Despite those flaws, it mostly works. It’s a solid Disney movie that leans on spectacle and movement, capturing the joy of freedom and nature. It’s entertaining, it looks great, and it moves like a bullet train. You can't ask for much more from an animated adventure."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/tarzan/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-napoleon-dynamite", "slug": {"_type": "slug", "current": "napoleon-dynamite"}, "title": "Napoleon Dynamite", "director": "Jared Hess", "year": "2004", "publishedDate": "2025-12-20", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A charm-filled comedy that perfectly captures the physical discomfort of adolescence.", "paragraphs": ["Napoleon Dynamite works because it embraces its quirks. So many indie comedies try to force a sense of weirdness, but here it feels natural. Director Jared Hess creates a world that’s beige, brown, and pale, serving as a visual representation of boredom. The awkwardness is established immediately in the opening sequence, and the film never blinks. It feels like a glimpse into a lobotomized reality.", "Jon Heder is iconic. He embodies the physical discomfort of adolescence perfectly. The humor comes from the way these bizarre characters interact with one another. It's both punchline-driven and vibe-driven. It has a charm that prevents it from becoming mean-spirited or overbearing.", "The pacing is surprisingly great for a movie where nothing happens. The characters are interesting enough to keep you watching. And the ending dance scene is effective because it’s the only burst of color and energy in the entire film. It’s a moment of pure expression for a character who has been repressed the entire time, serving as an earned victory."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/napoleon-dynamite/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-hotel-transylvania", "slug": {"_type": "slug", "current": "hotel-transylvania"}, "title": "Hotel Transylvania", "director": "Genndy Tartakovsky", "year": "2012", "publishedDate": "2025-12-21", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A snappy and energetic animation that invokes a sense of childlike joy.", "paragraphs": ["I’ve been watching a lot of classic Disney films recently, so I threw Hotel Transylvania into the mix expecting it to be a significant drop in quality, but I was wrong. It’s on a similar level of enjoyment, largely thanks to director Genndy Tartakovsky. He brings a frantic, snappy energy to the animation that saves the film from being a generic Adam Sandler comedy.", "Dracula moves with fast, exaggerated poses that are fun to watch. Tartakovsky balances the gross-out humor you expect with a story that’s surprisingly reserved and sweet. There are very few moments where I rolled my eyes at the stupidity. It’s a loud, aggressive film, but it’s also breezy, invoking a sense of childlike joy that works even for a 21-year-old.", "The voice cast is great. Sandler, Selena Gomez, and Andy Samberg embody their characters well, bringing a sense of fun to the ensemble. It’s a story that could have been lazy, but the execution elevates it. It’s a joyous experience with enough levity to make it an easy watch."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/hotel-transylvania/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-bambi", "slug": {"_type": "slug", "current": "bambi"}, "title": "Bambi", "director": "David Hand", "year": "1942", "publishedDate": "2025-12-22", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A gorgeous and mature exploration of the cycle of nature and invisible threat.", "paragraphs": ["Bambi is exactly what I’ve been looking for in classic animation. It’s utterly gorgeous. The impressionistic backgrounds created by Tyrus Wong give the forest a dreamlike, soft quality that draws you into the senses of the characters. It’s less about a plot and more about the cycle of nature. But beneath the cute exterior, it’s a surprisingly mature film.", "The portrayal of Man™ is fascinating because we never see him. We only hear the ominous three-note music cue. It creates a sense of stress that’s far more frightening than a visual monster, suggesting that violence is an invisible, intrusive force that can interrupt life at any moment.", "The death of Bambi’s mother remains tragic and endlessly emotional. It shifts the tone of the film from playful to somber. The first half is cute; the second half is a intense. It loses itself slightly in the runtime and feels like it might have been better as a short film, but the ending is triumphant. It earns its spot as one of the most important animated films ever made."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/bambi/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-cinderella", "slug": {"_type": "slug", "current": "cinderella"}, "title": "Cinderella", "director": "Hamilton Luske, Clyde Geronimi, & Wilfred Jackson", "year": "1950", "publishedDate": "2025-12-23", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "The quintessential fairy tale told with efficiency, grace, and chilling villainy.", "paragraphs": ["Cinderella is the quintessential fairy tale. It’s a classic story told with efficiency and grace. It’s hard to critique a film that’s so fundamental to the genre because it exists almost beyond criticism, ingrained in the cultural DNA. The animation is lovely, and the story gets to the point quickly, working on an emotional level that holds up.", "I was surprised, however, by the pacing. The climax with the glass slipper happens so late in the runtime. You expect the ball to be the middle, but it’s the finale. It works because the buildup of Cinderella's domestic abuse at the hands of her stepfamily makes the release of that night so powerful. The stepmother is a chilling villain, terrifying in her quiet cruelty.", "It’s a film that every child should see. It has a sense of wonder that holds up. The magic feels magical, and the mice are charming. It’s a simple story, but it’s told with such conviction that you can't help but be swept up in it. It’s an intriguing watch that reminds you why the princess trope exists in the first place."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/cinderella/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-a-christmas-story", "slug": {"_type": "slug", "current": "a-christmas-story"}, "title": "A Christmas Story", "director": "Bob Clark", "year": "1983", "publishedDate": "2025-12-25", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A festive tradition that masterfully captures the stressful and chaotic holiday reality.", "paragraphs": ["A Christmas Story has been a fundamental part of my life and a yearly tradition. This year, however, it took on a new meaning. Spending Christmas away from my family for the first time, I felt a little less like the wide-eyed kid and a little more like Ralphie in his darker moments. But watching it on a 24-hour loop while cooking made me realize that the film is like a choose your own adventure book.", "Because it’s structured as a series of vignettes, you can tune in at any point and find something to love. Ralphie’s life is a collection of distinct memories; the lamp, the tongue on the pole, the bunny suit. I love every single one of them. The writing is unbelievably good. Jean Shepherd’s voiceover weaves a tapestry of obscenities that elevates childhood anecdotes into myth.", "The way the Old Man says frag-ee-lay. must be italian kills me every time. It’s a film that captures the specific mania of the holidays perfectly. It’s a classic for a reason. It’s the perfect Christmas movie because it acknowledges that the holiday is stressful, chaotic, and disappointing, but ultimately full of love."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/a-christmas-story/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-sleeping-beauty", "slug": {"_type": "slug", "current": "sleeping-beauty"}, "title": "Sleeping Beauty", "director": "Clyde Geronimi", "year": "1959", "publishedDate": "2025-12-27", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A staggering achievement in fantasy storytelling with an iconic villain.", "paragraphs": ["Classics are classics for a reason, and Sleeping Beauty is the most illustrious of them all. It’s a staggering achievement in fantasy storytelling. The 70mm widescreen presentation gives it a scope that few other animated films possess. It looks like a moving tapestry. The colors, the backgrounds, and the character designs are sharp and distinct.", "The film shines through its supporting cast. Prince Phillip is one of the best Disney heroes because he’s active; he actually fights the dragon. Maleficent is the greatest Disney villain, period. She’s pure elegance and pure evil. The fairies provide the heart and the humor. However, Aurora herself is the weak link. She has very little agency, basically acting as a prop that’s moved from the forest to the castle to the tower.", "Despite that, the film has a sense of magic that’s undeniable. The climax, with the prince fighting through the thorns to battle a dragon, is essentially an action movie. It balances the drama, the fantasy, and the action perfectly. It’s an enchanting movie that’s fun to watch, even if the title character spends a good chunk of it asleep."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/sleeping-beauty/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-lady-and-the-tramp", "slug": {"_type": "slug", "current": "lady-and-the-tramp"}, "title": "Lady and the Tramp", "director": "Hamilton Luske, Clyde Geronimi, & Wilfred Jackson", "year": "1955", "publishedDate": "2025-12-28", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A domestic romance that succeeds in charm but lacks epic resonance.", "paragraphs": ["Lady and the Tramp is a classic Disney movie, but it’s not a classic animated movie in the same vein as Sleeping Beauty. It operates on a different scale, more domestic, more grounded. It’s about dogs living in the suburbs. Watching it right after the high fantasy of other Disney films, it suffers a bit from that specificity. It feels smaller.", "The specificity hurts it in other ways, too. The Siamese cats sequence is a relic that feels dated and uncomfortable now. It breaks the timelessness that Disney usually strives for. However, the romance itself works. The spaghetti scene is iconic because it captures a universal feeling of connection in a very specific, charming way. The contrast between the posh Lady and the street-smart Tramp is a trope that works.", "The dogs feel realistic. They move and act like dogs, which is a technical achievement, but maybe that realism keeps it from soaring emotionally. It’s a solid story. It’s entertaining. It’s cute. But it lacks the epic resonance of the fairy tales. It’s a good movie, but it feels like a product of its time rather than a timeless masterpiece."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/lady-and-the-tramp/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-peter-pan", "slug": {"_type": "slug", "current": "peter-pan"}, "title": "Peter Pan", "director": "Hamilton Luske, Clyde Geronimi, & Wilfred Jackson", "year": "1953", "publishedDate": "2025-12-29", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "An endlessly entertaining exploration of imagination and the wonder of magic.", "paragraphs": ["Peter Pan does an incredible job of exploring the imagination of childhood. I’ve always been in favor of films that encourage dreaming big, and this is the embodiment of that philosophy. Watching it, even as an adult, you feel like you could fly. There’s a wonder here that makes these older Disney movies endlessly entertaining. It taps into the part of your brain that believes in magic.", "Peter Pan is a fascinating protagonist because he’s a bit of a brat. He’s arrogant and cocky, but that makes him cool. He and Captain Hook are compelling rivals because they’re both so dramatic. I also find it curious that Tinker Bell, a mute sidekick who’s essentially jealous and mean for half the movie, became such a massive icon. It speaks to the strength of the character animation.", "There are flaws, of course. The depiction of the Native Americans is strange and dated. But if you can look past that, the core of the film holds up. It has aged remarkably well in its message. It’s a film you can show to your children 100 years from now, and they’ll still want to jump off the bed and fly."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/peter-pan/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-chicken-run", "slug": {"_type": "slug", "current": "chicken-run"}, "title": "Chicken Run", "director": "Nick Park & Peter Lord", "year": "2000", "publishedDate": "2025-12-30", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A handcrafted claymation masterpiece that is hilarious, unique, and special.", "paragraphs": ["The combination of British humor and Aardman’s claymation direction leads to a fantastic result in Chicken Run. It’s hilarious, beautifully animated, and totally unique. In a world dominated by digital animation, the tactile nature of claymation stands out. You can feel the fingerprints on the characters. It takes a lot of effort to make a film like this, and that arduous process translates into a film that feels handcrafted and special.", "Rocky, the cocky American rooster, is a great character because he’s a fraud. He talks a big game, but his arc of learning to actually care about the flock is endearing. The dynamics between the hens are funny and specific. It feels like the writers were writing for themselves, not a corporate mandate, which makes the humor land harder.", "It’s a shame that these films are so difficult to make because I’d watch a dozen sequels. But perhaps the scarcity is what makes it special. Every frame is packed with personality. It’s a fun, thrilling, and charming movie that proves you don't need pixels to make a blockbuster. You just need clay and a good script."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/chicken-run/umc.cmc.249v99qf3s2gocv1bbt1r"}
{"_type": "vaultReview", "_id": "vault-the-roses", "slug": {"_type": "slug", "current": "the-roses"}, "title": "The Roses", "director": "Jay Roach", "year": "2025", "publishedDate": "2025-12-31", "ratingStars": "★★★", "heroImage": "https://image.tmdb.org/t/p/original/jay-roach-roses-backdrop.jpg", "verdict": "An entertaining piece of breakup satire that is a victim of its own marketing.", "paragraphs": ["The Roses a victim of its own marketing. The trailer had already given away the ending. We knew from the first teaser that Olivia Colman's going to pull a gun on Benedict Cumberbatch. We knew the house's going to be destroyed. Watching the film is just a checklist exercise. You're not watching a story unfold and are just waiting for the inevitable explosion. It's cheapened the experience and robbed the narrative of its tension.", "That said, the explosion's still fun to watch. There's a primal satisfaction in watching wealthy, successful people absolutely wreck their lives over petty grievances. The inciting incident, where Theo has lost his job and his museum while Ivy’s restaurant empire is taking off, is a classic setup for male insecurity. The film's leaning into the physical comedy of their hatred. Seeing them smash expensive heirlooms and destroy drywall acts as a catharsis for the audience.", "The supporting cast does some heavy lifting. Andy Samberg and Kate McKinnon act as a Greek Chorus to the madness. They've brought a surprising amount of sincerity to their roles. They're reacting the way we'd react. They're horrified, but they can't look away. McKinnon's grounding the film. She's reminding us that these're real people destroying each other and aren't just cartoons.", "Ultimately, The Roses is a breakup movie that's taken things to the extreme. It's satirizing the way money will amplify our worst impulses. It's suggesting that love's a battlefield regardless of your tax bracket. It's entertaining and is very funny. It's got great actors having a good time. It just isn't essential. It's a disposable piece of entertainment that you'll enjoy for 105 minutes and'll forget immediately after. It's good for a laugh, but it won't save your marriage."], "footerText": "The Roses is in theaters now", "footerLink": "https://www.amazon.com/The-Roses-Olivia-Colman/dp/B0D5ROSES"}
{"_type": "vaultReview", "_id": "vault-palm-springs", "slug": {"_type": "slug", "current": "palm-springs"}, "title": "Palm Springs", "director": "Max Barbakow", "year": "2020", "publishedDate": "2025-12-31", "ratingStars": "★★★★★", "heroImage": "https://image.tmdb.org/t/p/original/249v99qf3s2gocv1bbt1r.jpg", "verdict": "A perfect machine that uses the time loop trope to explore existential weight.", "paragraphs": ["I’ve seen Palm Springs dozens of times over the last three years, and at this point, it’s less like a movie and more like a mirror. I’ve made it a tradition to start and end my year with a rewatch, so sitting down for this loop feels like checking in with an old friend who knows exactly where I’ve been. This was my 475th film of the year, which is a bit of a dip from last year’s 500, but life got a lot busier in 2025. Still, there’s something comforting about the fact that no matter how much my own life changes, Nyles and Sarah are still stuck at that wedding, trying to figure out if anything actually matters.", "It’s my number one movie of all time because it’s a perfect machine. Every piece of it's just so endlessly exciting, from Andy Siara’s razor-sharp script to the way Max Barbakow directs the hell out of the desert landscape. The chemistry between Andy Samberg and Cristin Milioti is the engine that makes it run, but it’s the existential weight behind the jokes that keeps me coming back. It’s a film that understands that the real time loop isn’t a magical vortex in a cave; it’s the terrifying realization that we have to wake up and be the same person every single day.", "Matthew Compton’s score and Quyen Tran’s cinematography give the film a vibrant, sun-drenched texture that masks the low-key melancholy at its core. It’s the perfect loop, moving with a pacing that feels effort-less no matter how many times I’ve memorized the beats. This rewatch was the final entry of my year, and as I close the book on 2025, I’m reminded of why I love this medium so much. Movies like this give us a way to track our own growth against something that never changes. It was a busy year, sure, but ending it here makes the world seem a little less mundane."], "footerText": "Rent or buy on Apple TV", "footerLink": "https://tv.apple.com/us/movie/palm-springs/umc.cmc.249v99qf3s2gocv1bbt1r"}